littleclock2/MSPM0-Examples/AD9833_drive/Core/inc/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0L130X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0L130X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     32000000



/* Defines for SPI_0 */
#define SPI_0_INST                                                         SPI0
#define SPI_0_INST_IRQHandler                                   SPI0_IRQHandler
#define SPI_0_INST_INT_IRQN                                       SPI0_INT_IRQn
#define GPIO_SPI_0_PICO_PORT                                              GPIOA
#define GPIO_SPI_0_PICO_PIN                                       DL_GPIO_PIN_5
#define GPIO_SPI_0_IOMUX_PICO                                    (IOMUX_PINCM6)
#define GPIO_SPI_0_IOMUX_PICO_FUNC                    IOMUX_PINCM6_PF_SPI0_PICO
#define GPIO_SPI_0_POCI_PORT                                              GPIOA
#define GPIO_SPI_0_POCI_PIN                                      DL_GPIO_PIN_10
#define GPIO_SPI_0_IOMUX_POCI                                   (IOMUX_PINCM11)
#define GPIO_SPI_0_IOMUX_POCI_FUNC                   IOMUX_PINCM11_PF_SPI0_POCI
/* GPIO configuration for SPI_0 */
#define GPIO_SPI_0_SCLK_PORT                                              GPIOA
#define GPIO_SPI_0_SCLK_PIN                                       DL_GPIO_PIN_6
#define GPIO_SPI_0_IOMUX_SCLK                                    (IOMUX_PINCM7)
#define GPIO_SPI_0_IOMUX_SCLK_FUNC                    IOMUX_PINCM7_PF_SPI0_SCLK
#define GPIO_SPI_0_CS0_PORT                                               GPIOA
#define GPIO_SPI_0_CS0_PIN                                        DL_GPIO_PIN_2
#define GPIO_SPI_0_IOMUX_CS0                                     (IOMUX_PINCM3)
#define GPIO_SPI_0_IOMUX_CS0_FUNC                      IOMUX_PINCM3_PF_SPI0_CS0
#define GPIO_SPI_0_CS1_PORT                                               GPIOA
#define GPIO_SPI_0_CS1_PIN                                        DL_GPIO_PIN_3
#define GPIO_SPI_0_IOMUX_CS1                                     (IOMUX_PINCM4)
#define GPIO_SPI_0_IOMUX_CS1_FUNC                IOMUX_PINCM4_PF_SPI0_CS1_POCI1



/* Port definition for Pin Group OLED */
#define OLED_PORT                                                        (GPIOA)

/* Defines for DC: GPIOA.4 with pinCMx 5 on package pin 8 */
#define OLED_DC_PIN                                              (DL_GPIO_PIN_4)
#define OLED_DC_IOMUX                                             (IOMUX_PINCM5)
/* Port definition for Pin Group AD9833 */
#define AD9833_PORT                                                      (GPIOA)

/* Defines for SCLK: GPIOA.14 with pinCMx 15 on package pin 18 */
#define AD9833_SCLK_PIN                                         (DL_GPIO_PIN_14)
#define AD9833_SCLK_IOMUX                                        (IOMUX_PINCM15)
/* Defines for PICO: GPIOA.15 with pinCMx 16 on package pin 19 */
#define AD9833_PICO_PIN                                         (DL_GPIO_PIN_15)
#define AD9833_PICO_IOMUX                                        (IOMUX_PINCM16)
/* Defines for CS1: GPIOA.12 with pinCMx 13 on package pin 16 */
#define AD9833_CS1_PIN                                          (DL_GPIO_PIN_12)
#define AD9833_CS1_IOMUX                                         (IOMUX_PINCM13)
/* Defines for CS2: GPIOA.11 with pinCMx 12 on package pin 15 */
#define AD9833_CS2_PIN                                          (DL_GPIO_PIN_11)
#define AD9833_CS2_IOMUX                                         (IOMUX_PINCM12)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_SPI_0_init(void);



#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
